// - Є змінна х, якій ви надаєте довільне числове значення.
// Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
//     Перевірте скрипт при a, що дорівнює 1, 0, -3

let x = 0;
if (x !== 0) {
    console.log('Невірно');
} else {
    console.log('Вірно');
}

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
//     до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time = 59;
if (time >= 0 && time < 15) {
    console.log('Перша четверть');
} else if (time >= 15 && time < 30) {
    console.log('Друга четверть');
} else if (time >= 30 && time < 45) {
    console.log('Третя четверть');
} else if (time >= 45 && time <= 59) {
    console.log('Четверта четверть');
}

// - У змінній day дано якесь число від 1 до 31.
// Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day = 16;
if (day >= 1 && day <= 10) {
    console.log('Перша декада');
} else if (day >= 11 && day <= 15) {
    console.log('Друга декада');
} else if (day >= 16 && day <= 31) {
    console.log('Третя декада');
}





