// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох.
//     Також потрібно врахувати коли введені рівні числа.

let a = 1;
let b = 1;

if (a > b) {
    console.log(a);
}else if (a < b) {
    console.log(b);
}else if (a === b) {
    console.log('a = b');
}

// - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null і т.д включно). Напишіть код який,
//     буде присвоювати змінній х значення "default" якщо ви намагаєтесь присвоїти в неї falsy-значення
// (хибноподібні, тобто ті, які приводиться до false, а це 0 null undefined і т.д).

let y;
if (!y) {
    console.log('default');
}